// console.log('task 40');

// // 40.Дан массив. Вывести каждый отдельный элемент в консоль (for)

// {
//     let array = ['', ',', ',', ',', ',,', ',', '', ','];
//     for (i = 0; i < array.length; i++) {
//         console.log(array[i]);
//     }
// }

// console.log('task 41');

// // 41. На вход программе подается строка текста, состоящая из слов, разделенных
// // ровно одним пробелом. Напишите программу, которая подсчитывает количество
// // слов в ней

// {
//     let text = prompt();
//     alert(`${text.split(' ').length} слов`);
// }

// console.log('Task 42');

// // 42.Пользователь вводит строку. Необходимо посчитать количество гласных

// {
//     let text = prompt();
//     let value = 0;
//     let array = ['у', 'е', 'ы', 'а', 'о', 'э', 'я', 'и', 'ю'];
//     for (i = 0; i < text.length; i++) {
//         if (array.includes(text[i].toLowerCase())) {
//             value++;
//         }
//     }
//     alert(value);
// }
